In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib notebook

In [2]:
tn_movie_budgets = pd.read_csv('./data/tn.movie_budgets.csv.gz')

In [3]:
tn_movie_budgets.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"$425,000,000","$760,507,625","$2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"$410,600,000","$241,063,875","$1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"$350,000,000","$42,762,350","$149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"$330,600,000","$459,005,868","$1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"$317,000,000","$620,181,382","$1,316,721,747"

In [4]:
tn_movie_budgets.columns

Index(['id', 'release_date', 'movie', 'production_budget', 'domestic_gross',
       'worldwide_gross'],
      dtype='object')

## Missing Values

In [5]:
tn_movie_budgets.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5782 entries, 0 to 5781
Data columns (total 6 columns):
id                   5782 non-null int64
release_date         5782 non-null object
movie                5782 non-null object
production_budget    5782 non-null object
domestic_gross       5782 non-null object
worldwide_gross      5782 non-null object
dtypes: int64(1), object(5)
memory usage: 271.1+ KB

no missing values

In [6]:
print((tn_movie_budgets[['id','release_date','movie','production_budget','domestic_gross','worldwide_gross']]==0).sum())

id                   0
release_date         0
movie                0
production_budget    0
domestic_gross       0
worldwide_gross      0
dtype: int64

data has no zeros

## Duplicates

In [7]:
tn_movie_duplicates= tn_movie_budgets[tn_movie_budgets.duplicated()]

In [8]:
print(len(tn_movie_duplicates))

0

Data has no duplicates

## Check for Extreneous Values in Data

In [9]:
for col in tn_movie_budgets.columns:
    print(col, '\n', tn_movie_budgets[col].value_counts(normalize=True).head(), '\n\n')

id
 4     0.010031
53    0.010031
61    0.010031
65    0.010031
69    0.010031
Name: id, dtype: float64


release_date
 Dec 31, 2014    0.004151
Dec 31, 2015    0.003978
Dec 31, 2010    0.002594
Dec 31, 2008    0.002421
Dec 31, 2013    0.002248
Name: release_date, dtype: float64


movie
 Home         0.000519
Halloween    0.000519
King Kong    0.000519
Ca$h         0.000346
Unknown      0.000346
Name: movie, dtype: float64


production_budget
 $20,000,000    0.039952
$10,000,000    0.036666
$30,000,000    0.030612
$15,000,000    0.029920
$25,000,000    0.029575
Name: production_budget, dtype: float64


domestic_gross
 $0             0.094777
$8,000,000     0.001557
$2,000,000     0.001211
$7,000,000     0.001211
$10,000,000    0.001038
Name: domestic_gross, dtype: float64


worldwide_gross
 $0            0.063473
$8,000,000    0.001557
$2,000,000    0.001038
$7,000,000    0.001038
$9,000,000    0.000692
Name: worldwide_gross, dtype: float64

data do not show any extreneous values

##  Quantitative View of Data

In [10]:
tn_movie_budgets.describe().T # decribe the data

     count       mean        std  min   25%   50%   75%    max
id  5782.0  50.372363  28.821076  1.0  25.0  50.0  75.0  100.0

    # We need to do data tranformation

## Data Types Convertion

In [11]:
tn_movie_budgets.dtypes

id                    int64
release_date         object
movie                object
production_budget    object
domestic_gross       object
worldwide_gross      object
dtype: object

convert col to category variables

In [12]:
#df.astype('int32').dtypes
#tn_movie_budgets['worldwide_gross'].astype('category')

In [13]:
tn_movie_budgets['production_budget']=tn_movie_budgets.production_budget.str.replace('$','')

In [17]:
tn_movie_budgets['domestic_gross']=tn_movie_budgets.domestic_gross.str.replace('$','')

In [18]:
tn_movie_budgets['worldwide_gross']=tn_movie_budgets.worldwide_gross.str.replace('$','')

In [19]:
tn_movie_budgets.head()

,id,release_date,movie,production_budget,domestic_gross,worldwide_gross
0,1,"Dec 18, 2009",Avatar,"425,000,000","760,507,625","2,776,345,279"
1,2,"May 20, 2011",Pirates of the Caribbean: On Stranger Tides,"410,600,000","241,063,875","1,045,663,875"
2,3,"Jun 7, 2019",Dark Phoenix,"350,000,000","42,762,350","149,762,350"
3,4,"May 1, 2015",Avengers: Age of Ultron,"330,600,000","459,005,868","1,403,013,963"
4,5,"Dec 15, 2017",Star Wars Ep. VIII: The Last Jedi,"317,000,000","620,181,382","1,316,721,747"

## Data Types Convertion

In [24]:
tn_movie_budgets.describe().T # decribe the data

     count       mean        std  min   25%   50%   75%    max
id  5782.0  50.372363  28.821076  1.0  25.0  50.0  75.0  100.0

In [16]:
tn_movie_budgets.dtypes

id                    int64
release_date         object
movie                object
production_budget    object
domestic_gross       object
worldwide_gross      object
dtype: object

challeng is that data types listed as objects needs to be transformed to enable calculations